In [4]:
from datascience import *

In [5]:
Table()

In [6]:
Table().with_columns('Number of petals', make_array(8, 34, 5))

Number of petals
8
34
5

In [5]:
Table().with_columns('Number of Vegetables', make_array(8, 34, 5), 'Name', make_array('Tomatoes','Rape','Onion'))

Number of Vegetables | Name
8                    | Tomatoes
34                   | Rape
5                    | Onion

In [8]:
report = Table().with_columns('Number of Vegetables', make_array(8, 34, 5), 'Name', make_array('Tomatoes','Rape','Onion'))
report.with_columns('Province', make_array('Lusaka','Luapula','Copperbelt'))

Number of Vegetables | Name     | Province
8                    | Tomatoes | Lusaka
34                   | Rape     | Luapula
5                    | Onion    | Copperbelt

In [9]:
report

Number of Vegetables | Name
8                    | Tomatoes
34                   | Rape
5                    | Onion

In [10]:
report.num_columns #finds the number of columns

2

In [11]:
report.num_rows #finds the number of rows

3

In [12]:
#list the column labels
report.labels

(&#39;Number of Vegetables&#39;, &#39;Name&#39;)

In [15]:
#rename label
report.relabel('Number of Vegetables','# of Vegetables')

# of Vegetables | Name
8               | Tomatoes
34              | Rape
5               | Onion

In [18]:
report

# of Vegetables | Name
8               | Tomatoes
34              | Rape
5               | Onion

In [19]:
#access data in a column
report.column('Name')

array([&#39;Tomatoes&#39;, &#39;Rape&#39;, &#39;Onion&#39;], dtype=&#39;&lt;U8&#39;)

In [20]:
#columns are indexed starting form 0
report.column(1)

array([&#39;Tomatoes&#39;, &#39;Rape&#39;, &#39;Onion&#39;], dtype=&#39;&lt;U8&#39;)

In [21]:
report.column(1).item(1)

&#39;Rape&#39;

In [25]:
intial = report.column('# of Vegetables').item(0)
report = report.with_columns('Tomato ratio', report.column('# of Vegetables')/intial ) 
report

# of Vegetables | Name     | Tomato ratio
8               | Tomatoes | 1
34              | Rape     | 4.25
5               | Onion    | 0.625

In [26]:
report.set_format('Tomato ratio', PercentFormatter)

# of Vegetables | Name     | Tomato ratio
8               | Tomatoes | 100.00%
34              | Rape     | 425.00%
5               | Onion    | 62.50%

In [27]:
#select
report.select(0,1)

# of Vegetables | Name
8               | Tomatoes
34              | Rape
5               | Onion

In [28]:
report.select('Tomato ratio')

Tomato ratio
100.00%
425.00%
62.50%

In [29]:
#droping Tables
report.drop('Tomato ratio')

# of Vegetables | Name
8               | Tomatoes
34              | Rape
5               | Onion

In [30]:
report

# of Vegetables | Name     | Tomato ratio
8               | Tomatoes | 100.00%
34              | Rape     | 425.00%
5               | Onion    | 62.50%